In [1]:
import pandas as pd

In [3]:
df = pd.Series([1, 2, 3, 4, 5])
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
df = pd.DataFrame([1,2,3,4,5])
df

   0
0  1
1  2
2  3
3  4
4  5

In [6]:
df = pd.read_csv("../users.csv")
df

   ID Username  Password            Email       Phone
0   3     Abhi   abhi123    xyz@gmail.com  9995600650
1   5    Kitty  kitty123  kitty@gmail.com  9876580987
2   6   Kimono    kim123    kim@yahoo.com   897650987

In [3]:
df = pd.Series({'A':1, 'B':2, 'C':3, 'D':4, 'E':5})
df

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [7]:
X = {'A':1, 'B':2, 'C':3, 'D':4, 'E':5}

df = pd.DataFrame(X, index=[0])
df

   A  B  C  D  E
0  1  2  3  4  5

In [9]:
df = pd.read_csv("sample.csv")
df

   Name Brand Model  number
0   BMW    B1   NaN  4545.0
1  Benz   NaN    w2  5645.0
2   NaN    A1    w3  8989.0
3   BMW    B1    w1     NaN
4  Benz   Be1    w2  3445.0
5   BMW    B1    w1    45.0
6  Benz   Be1   NaN  5656.0
7  Benz   Be1    w2  3445.0
8   BMW    B1    w1    45.0
9  Benz   Be1   NaN  5656.0

In [16]:
X={'A':[1,2,3,4,5], 'B':[6,7,8,9,10]}
df=pd.DataFrame(X)
df['B'].add(15)
# df

0    21
1    22
2    23
3    24
4    25
Name: B, dtype: int64

In [17]:
X={'A':[1,2,3,4,5], 'B':[6,7,8,9,10]}
df=pd.DataFrame(X)
df['B'] = df['B'].add(15)
df

   A   B
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

In [18]:
X={'A':[1,2,3,4,5], 'B':[6,7,8,9,10]}
df=pd.DataFrame(X)
df['C'] = df['B'].add(15)
df

   A   B   C
0  1   6  21
1  2   7  22
2  3   8  23
3  4   9  24
4  5  10  25

In [36]:
data = {
    'X':[50,40,30],
    'Y':[100.3,200.5,150.75],
   
}

df = pd.DataFrame(data)
df['C']=df.sum(axis=1)
# df

In [27]:
data = {
    'A':[1,2,3,4,5],
    'B':[6,7,8,9,10]
}

df = pd.DataFrame(data)

df['C']=df['B'].pow(2)
df

   A   B    C
0  1   6   36
1  2   7   49
2  3   8   64
3  4   9   81
4  5  10  100

In [37]:
data={
    'A':[1,2,3,4,5],
    'B':[6,7,8,9,10]
}

df = pd.DataFrame(data)

df['C'] = df['B'].div(df['A'])

df

   A   B         C
0  1   6  6.000000
1  2   7  3.500000
2  3   8  2.666667
3  4   9  2.250000
4  5  10  2.000000

In [38]:
data={
    'A': [1,2,3,4,5],
    'B': [6,7,8,9,10]
}

df = pd.DataFrame(data)

df['C'] = df['A'].mul(df['B'])
df

   A   B   C
0  1   6   6
1  2   7  14
2  3   8  24
3  4   9  36
4  5  10  50

In [41]:
A = int(input("Enter the First Number: "))
B = int(input("Enter the Second Nummber: "))



# df = pd.DataFrame()

df= A * B
df
# df

4

In [43]:
data = {
    'A':[1,2,3,4,5],
    'B':[6,7,8,9,10]
    }

df = pd.DataFrame(data)

df['C'] = df['B'].sub(df['A'])
df

   A   B  C
0  1   6  5
1  2   7  5
2  3   8  5
3  4   9  5
4  5  10  5

In [45]:
data = [[10,20,30,40,50], [60,70,80,90,100], [110,120,130,140,150]]

df = pd.DataFrame(data)

print(df)

df.diff()

     0    1    2    3    4
0   10   20   30   40   50
1   60   70   80   90  100
2  110  120  130  140  150

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1  50.0  50.0  50.0  50.0  50.0
2  50.0  50.0  50.0  50.0  50.0

In [75]:
df = pd.read_csv("student_marks.csv")
# df['Total Marks'] = df[Maths].sum(df['Physics'])
df['Total Marks'] = df['Maths'].add(df['Physics']).add(df['Chemistry']).add(df['English']).add(df['Biology']).add(df['Economics']).add(df['History']).add(df['Civics'])
df['Average Marks'] = df['Total Marks'].div(8)
df

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,Total Marks,Average Marks
0,John,M,05-04-1988,55,45,56,87,21,52,89,65,470,58.750
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2,524,65.500
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74,556,69.500
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45,586,73.250
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53,587,73.375
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52,556,69.500
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61,496,62.000
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87,517,64.625
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89,587,73.375
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77,566,70.750

In [83]:
df = pd.read_csv("car-sales-extended-missing-data.csv")
# df.dropna(inplace=False)
df.fillna(0,inplace=True)
df

       Make Colour  Odometer (KM)  Doors    Price
0     Honda      0        35431.0    4.0  15323.0
1       BMW   Blue       192714.0    0.0  19943.0
2     Honda  White            0.0    4.0  28343.0
3    Toyota  White       154365.0    4.0      0.0
4    Nissan   Blue       181577.0    3.0  14043.0
..      ...    ...            ...    ...      ...
995  Toyota  Black        35820.0    4.0  32042.0
996       0  White       155144.0    3.0   5716.0
997  Nissan   Blue        66604.0    4.0  31570.0
998   Honda  White       215883.0    4.0   4001.0
999  Toyota   Blue       248360.0    4.0  12732.0

[1000 rows x 5 columns]